title: 'KTLYST - Component discovery to administrative control takeover'
id: c15b6bec-0891-53a2-8418-c7fbc0c519ba
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1082
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\whoami.exe'
            - '\net.exe'
            - '\nltest.exe'
            - '\ipconfig.exe'
            - '\systeminfo.exe'
    condition: selection
falsepositives:
    - Legitimate administrative activity