title: 'KTLYST - www.propublica.org'
id: bba8f40c-c66d-50d9-a5d4-9bbc0a6e8ea0
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'www.propublica.org'
    condition: selection
falsepositives:
    - Legitimate administrative activity