title: 'KTLYST - Communication breakdown leading to service disruption'
id: 0cae9119-6b42-5c64-b27c-c89929f942c7
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
logsource:
    category: authentication
    product: any
detection:
    selection:
        status: 'failure'
    filter_low_count:
        count|gte: 5
    condition: selection
falsepositives:
    - Legitimate administrative activity