title: 'KTLYST - Supply chain disruption through developer account terminatio'
id: aa0b3ae0-aeef-5ec2-a158-92cd00f7b556
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1195
logsource:
    category: process_creation
    product: any
detection:
    selection_process:
        Image|endswith:
            - '\npm.exe'
            - '\pip.exe'
            - '\nuget.exe'
    selection_action:
        CommandLine|contains|any:
            - 'install'
            - 'update'
    condition: selection_process and selection_action
falsepositives:
    - Legitimate administrative activity