title: 'KTLYST - iconics.com'
id: 31097e9d-2c44-5a73-83c9-7c47ec848d56
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 4
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 4'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'iconics.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity