[KTLYST - KTLYST Rule 1]
search = 
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - Fleetdeckio]
search = index=main sourcetype=network "Fleetdeck.io"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - Levelio]
search = index=main sourcetype=network "Level.io"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - MEGANZ]
search = index=main sourcetype=network "MEGA.NZ"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - targetsname-ssocom]
search = index=main sourcetype=network "targetsname-sso.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - targetsname-servicedeskcom]
search = index=main sourcetype=network "targetsname-servicedesk.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - targetsname-oktacom]
search = index=main sourcetype=network "targetsname-okta.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - targetsname-cmscom]
search = index=main sourcetype=network "targetsname-cms.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - targetsname-helpdeskcom]
search = index=main sourcetype=network "targetsname-helpdesk.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - oktalogin-targetcompanycom]
search = index=main sourcetype=network "oktalogin-targetcompany.com"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.

[KTLYST - IOC Detection - MEGANZ]
search = index=main sourcetype=network "MEGA.NZ"
| stats count as hit_count, earliest(_time) as first_seen, latest(_time) as last_seen by src_ip, dest_ip, user
| where hit_count >= 1
| sort -hit_count
| table src_ip, dest_ip, user, hit_count, first_seen, last_seen
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
cron_schedule = 0 * * * *
is_scheduled = 1
alert_type = number of events
alert_comparator = greater than
alert_threshold = 0
enableSched = 1
description = Auto-generated by KTLYST from threat intelligence.
