title: 'KTLYST - michelf.ca'
id: 4e9a9adf-2e00-5add-a816-d800c85b04f5
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 3
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 3'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'michelf.ca'
    condition: selection
falsepositives:
    - Legitimate administrative activity