{
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "displayName": "KTLYST - Block Device Code Flow (Ontario Power Generation)",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {
      "includeApplications": [
        "All"
      ]
    },
    "authenticationFlows": {
      "transferMethods": "deviceCodeFlow"
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeGroups": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ]
  },
  "metadata": {
    "generatedBy": "KTLYST",
    "generatedAt": "2026-04-13T18:13:58.583020+00:00",
    "advisory": "Unit42 Device Code OAuth Phishing",
    "note": "This policy is created in report-only mode. Review sign-in impact before enabling enforcement. Exclude service accounts and break-glass accounts as needed."
  }
}