title: 'KTLYST - Average window of exposure maximization'
id: 0e1418cf-b3b2-5f0d-ad18-1ba3e266ef93
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1547
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: 'CurrentVersion\Run'
    condition: selection
falsepositives:
    - Legitimate administrative activity