title: 'KTLYST - Help desk social engineering attack'
id: efdbf3c1-5b1b-5f8f-ad1e-81c382284f82
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1621
logsource:
    category: authentication
    product: any
detection:
    selection:
        status: 'failure'
    filter_low_count:
        count|gte: 5
    condition: selection
falsepositives:
    - Legitimate administrative activity