title: 'KTLYST - https://www.mitsubishielectric.co.jp/psirt/vulnerability/pdf'
id: d3e128f7-eb60-5bae-9f6d-d776f013c3fe
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 4
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 4'
tags:
    - attack.detection
logsource:
    category: proxy
    product: any
detection:
    selection:
        url|contains: 'https://www.mitsubishielectric.co.jp/psirt/vulnerability/pdf/2025-023.pdf'
    condition: selection
falsepositives:
    - Legitimate administrative activity