title: 'KTLYST - www.mitsubishielectric.co.jp'
id: 529454bb-1233-5a32-871f-abe2486fe9fa
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 4
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 4'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'www.mitsubishielectric.co.jp'
    condition: selection
falsepositives:
    - Legitimate administrative activity