title: 'KTLYST - Credential theft to follow-on access'
id: e668adcb-350b-5b71-942a-d5e460c6c5e8
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1557
logsource:
    category: authentication
    product: any
detection:
    selection:
        status: 'failure'
    filter_low_count:
        count|gte: 5
    condition: selection
falsepositives:
    - Legitimate administrative activity