title: 'KTLYST - www.googletagmanager.com'
id: 17190410-1d2b-5e1c-8106-1de95ca75419
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'www.googletagmanager.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity