title: 'KTLYST - advisory.It'
id: 74b07664-42aa-584c-a1a3-ff1d591effd2
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 2
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 2'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'advisory.It'
    condition: selection
falsepositives:
    - Legitimate administrative activity