title: 'KTLYST - Potential threat intelligence gathering attempt'
id: 2dfc722a-3562-5d86-90f1-41a48a668d33
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
logsource:
    category: authentication
    product: any
detection:
    selection:
        status: 'failure'
    filter_low_count:
        count|gte: 5
    condition: selection
falsepositives:
    - Legitimate administrative activity