title: 'KTLYST - www.ccontrols.com'
id: dac4a070-1d5b-5894-bad3-176e9f9a741e
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'www.ccontrols.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity