title: 'KTLYST - targetsname-okta.com'
id: f483de2f-1fae-56ce-9f99-e77d5a564f8f
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 5
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 5'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'targetsname-okta.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity