title: 'KTLYST - MEGA.NZ'
id: 03dbed6a-8085-5efc-82d7-f759e1ac5ed2
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 12
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 12'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'MEGA.NZ'
    condition: selection
falsepositives:
    - Legitimate administrative activity