title: 'KTLYST - oktalogin-targetcompany.com'
id: 05185669-0032-5409-bf57-e455bc8fbd50
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 5
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 5'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'oktalogin-targetcompany.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity