title: 'KTLYST - targetsname-sso.com'
id: 438dfc51-b6df-52e9-9c43-aa409a41db67
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 5
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 5'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'targetsname-sso.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity