title: 'KTLYST - Level.io'
id: 504dcc7f-456b-5e0d-95b0-126cabf3c3d5
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 3
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 3'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'Level.io'
    condition: selection
falsepositives:
    - Legitimate administrative activity