title: 'KTLYST - Fleetdeck.io'
id: a7ff8bbf-2dfe-5cc2-8442-36ee1b4d1fca
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 3
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 3'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'Fleetdeck.io'
    condition: selection
falsepositives:
    - Legitimate administrative activity