title: 'KTLYST - targetsname-cms.com'
id: f7b11a73-76a6-52c0-8d34-a0a6f3ead9cf
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 5
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 5'
tags:
    - attack.detection
logsource:
    category: dns
    product: any
detection:
    selection:
        dns.query.name|contains: 'targetsname-cms.com'
    condition: selection
falsepositives:
    - Legitimate administrative activity