title: 'KTLYST - Advanced loader deployment with known TTPs'
id: e4bac691-5efd-573a-8def-3ff24d6c8d6e
status: experimental
description: |
    Auto-generated detection rule.
    Source provenance: Page 1
level: medium
author: KTLYST
date: 2026/03/24
references:
    - 'KTLYST source: Page 1'
tags:
    - attack.detection
    - attack.t1562
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|any:
            - 'Set-MpPreference'
            - 'DisableRealtimeMonitoring'
            - '-ep bypass'
    condition: selection
falsepositives:
    - Legitimate administrative activity